000_РОЗНИЦА_ЦЕНТР/src/Catalogs/ОбщиеДанныеИнформационногоЦентра/ОбщиеДанныеИнформационногоЦентра.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОбщиеДанныеИнформационногоЦентра</name>
  <attributes>
    <name>Вложения</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнешняяСсылка</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаАктуальности</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияАктуальности</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>Критичность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстHTML</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипИнформации</name>
    <type>
      <types>CatalogRef.ТипыИнформацииИнформационногоЦентра</types>
    </type>
  </attributes>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/CommonForms/ОтображениеНовостей/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("ОткрытьВсеНовости") Тогда
		ОткрытьВсеНовости();
	ИначеЕсли Параметры.Свойство("ОткрытьНовость") Тогда
		Если Параметры.Свойство("Идентификатор") Тогда 
			ОткрытьНовость(Параметры.Идентификатор);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура НажатиеНаНовость(Элемент)
	
	МассивНовостей = ТаблицаВсехНовостей.НайтиСтроки(Новый Структура("ИмяНовости", Элемент.Имя));
	Если МассивНовостей.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;
	
	Идентификатор = МассивНовостей.Получить(0).Идентификатор;
	ВнешняяСсылка = МассивНовостей.Получить(0).ВнешняяСсылка;
	Если Не ПустаяСтрока(ВнешняяСсылка) Тогда 
		ПерейтиПоНавигационнойСсылке(ВнешняяСсылка);
		Возврат;
	КонецЕсли;
	
    ОткрытьНовость(Идентификатор);
 	
КонецПроцедуры

&НаКлиенте
Процедура ВсеНовостиНажатие(Элемент)
	
	Закрыть();
	ИнформационныйЦентрКлиент.ПоказатьВсеСообщения();
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура ОткрытьВсеНовости()
	
	Заголовок = НСтр("ru = 'Новости'");
	СформироватьСписокВсехНовостей();
	Элементы.ОбщаяГруппа.ТекущаяСтраница = Элементы.ГруппаНовостей;
	
КонецПроцедуры	

&НаСервере
Процедура ОткрытьНовость(Идентификатор)
	
	Элементы.ОбщаяГруппа.ТекущаяСтраница = Элементы.ГруппаНовости;
	УстановитьПривилегированныйРежим(Истина);
	СсылкаНаДанные	= Справочники.ОбщиеДанныеИнформационногоЦентра.НайтиПоРеквизиту("Идентификатор", Идентификатор);
	Если СсылкаНаДанные.Пустая() Тогда 
		Возврат;
	КонецЕсли;	
		
	Заголовок	= СсылкаНаДанные.Наименование;
	
	Вложения	= СсылкаНаДанные.Вложения.Получить();
	ТекстHTML	= СсылкаНаДанные.ТекстHTML;
	
	Если ТипЗнч(Вложения) = Тип("Структура") Тогда 
		СтруктруаВложений = Вложения;
	Иначе	
		СтруктруаВложений = Новый Структура;
	КонецЕсли;	
	
	Содержание.УстановитьHTML(ТекстHTML, СтруктруаВложений);
	
КонецПроцедуры	

&НаСервере
Процедура СформироватьСписокВсехНовостей()
	
	ТаблицаВсехНовостей.Очистить();
	
	УстановитьПривилегированныйРежим(Истина);
	
	ВозвращаемаяТаблица = ИнформационныйЦентрСервер.СформироватьСписокВсехНовостей();
	
	Если ВозвращаемаяТаблица.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;	
	
	ТаблицаВсехНовостей.Загрузить(ВозвращаемаяТаблица);
	
	ГруппаНовостей = Элементы.ГруппаВсехНовостей;
	
	Для Итерация = 0 По ТаблицаВсехНовостей.Количество() - 1 Цикл
		
		Критичность		= ТаблицаВсехНовостей.Получить(Итерация).Критичность;
		Наименование	= ТаблицаВсехНовостей.Получить(Итерация).Наименование;
		Картинка		= ?(Критичность > 5, БиблиотекаКартинок.СостояниеОбменаДаннымиОшибка, БиблиотекаКартинок.Информация_старая);
		
		ГруппаНовости						= Элементы.Добавить("ГруппаНовости" + Строка(Итерация), Тип("ГруппаФормы"), ГруппаНовостей);
		ГруппаНовости.Вид 					= ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаНовости.ОтображатьЗаголовок	= Ложь;
		ГруппаНовости.Группировка			= ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
		ГруппаНовости.Отображение			= ОтображениеОбычнойГруппы.Нет;
		
		КартинкаНовости						= Элементы.Добавить("КартинкаНовости" + Строка(Итерация), Тип("ДекорацияФормы"), ГруппаНовости);
		КартинкаНовости.Вид					= ВидДекорацииФормы.Картинка;
		КартинкаНовости.Картинка			= Картинка;
		КартинкаНовости.Ширина				= 2;
		КартинкаНовости.Высота				= 1;
		КартинкаНовости.РазмерКартинки		= РазмерКартинки.Растянуть;
		
		ИмяНовости							= Элементы.Добавить("ИмяНовости" + Строка(Итерация), Тип("ДекорацияФормы"), ГруппаНовости);
		ИмяНовости.Вид						= ВидДекорацииФормы.Надпись;
		ИмяНовости.Заголовок				= Наименование;
		ИмяНовости.РастягиватьПоГоризонтали	= Истина;
		ИмяНовости.ВертикальноеПоложение	= ВертикальноеПоложениеЭлемента.Центр;
		ИмяНовости.ВысотаЗаголовка			= 1;
		ИмяНовости.Гиперссылка	            = Истина;
		ИмяНовости.УстановитьДействие("Нажатие", "НажатиеНаНовость");
		
		Если Критичность = 10 Тогда 
			ИмяНовости.Шрифт = Новый Шрифт(, , Истина, , , );
		КонецЕсли;	
		
		ТаблицаВсехНовостей.Получить(Итерация).ИмяНовости = "ИмяНовости" + Строка(Итерация);
	
	КонецЦикла;	
	
КонецПроцедуры
